/*

אנחנו צריכים להשתמש במערכי העזר כדי לייעל את התוכנה 
והם מלווים אותנו באורך כל העץ 
לא לפחד להוסיף פרמטרים לריקורסיה 
פשוט להשתמש בפונקציית מעטפת
עדיף פרמטרים כדי לגזום את החלקים בריקורסיה שאנחנו לא רוצים בהם


נשים לב
החיפוש מתבצע על ידי התקדמות ונסיגה לאורך עץ האפשרויות 
מתקמים לאורך ענף בעץ כל עוד הפתרון הנבנה אינו מפר את הדרישות
אם הגענו לעלה בעץ מצאנו פתרון חוקי
כאשר ענף בעץ מתגלה כמוביל לפתרון לא חוקי מפסיקים את החיפוש בענף זה נשתמש ב
countinu
נסוגים לצומת הקרוב ביותר שבו קיימת אפשרות שטרם נבדקה
ריקורסיה הינה דרך אלגנטית לפקון בעיות בשיטה הזאת
למימוש רקורסיבי של חיפוש בעץ אפשרויות מבנה בסיסי שבלונה שיחזור על עצמו
*/